#  Напишите программу, которая будет преобразовывать
#  десятичное число в двоичное.

number = int(input('введите числo => '))
print(f'{number:b}')